src/src/Documents/EmploymentContract.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>EmploymentContract</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CompensationPlan</xr:Item>
				<xr:Item>InformationRegister.Employees</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Employees</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StructuralUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Position</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Positions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OccupiedRates</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>WorkSchedule</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.WorkSchedules</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EarningsDeductions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>EarningAndDeductionType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EarningAndDeductionTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GLExpenseAccount</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>IncomeTaxes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>EarningAndDeductionType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EarningAndDeductionTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/src/Documents/EmploymentContract/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Initializes the tables of values that contain the data of the document table sections.
// Saves the tables of values in the properties of the structure "AdditionalProperties".
//
Procedure InitializeDocumentData(DocumentRefCreateEmploymentContract, StructureAdditionalProperties) Export

	Query = New Query(
	"SELECT 
	|	&Company AS Company,
	|	EmploymentContractEmployees.LineNumber,
	|	EmploymentContractEmployees.Employee,
	|	EmploymentContractEmployees.StructuralUnit,
	|	EmploymentContractEmployees.Position,
	|	EmploymentContractEmployees.WorkSchedule,
	|	EmploymentContractEmployees.OccupiedRates,
	|	EmploymentContractEmployees.Period
	|INTO TableEmployees
	|FROM
	|	Document.EmploymentContract.Employees AS EmploymentContractEmployees
	|WHERE
	|	EmploymentContractEmployees.Ref = &Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT 
	|	&Company AS Company,
	|	EmploymentContractEmployees.LineNumber,
	|	EmploymentContractEmployees.Employee,
	|	EmploymentContractEmployees.Period,
	|	EmploymentContractPayrollRetention.EarningAndDeductionType,
	|	EmploymentContractPayrollRetention.Currency,
	|	EmploymentContractPayrollRetention.Amount,
	|	EmploymentContractPayrollRetention.GLExpenseAccount
	|INTO TableEarningsDeductions
	|FROM
	|	Document.EmploymentContract.Employees AS EmploymentContractEmployees
	|		INNER JOIN Document.EmploymentContract.EarningsDeductions AS EmploymentContractPayrollRetention
	|		ON EmploymentContractEmployees.ConnectionKey = EmploymentContractPayrollRetention.ConnectionKey
	|			AND EmploymentContractEmployees.Ref = EmploymentContractPayrollRetention.Ref
	|WHERE
	|	EmploymentContractEmployees.Ref = &Ref
	|
	|UNION ALL
	|
	|SELECT
	|	&Company,
	|	EmploymentContractEmployees.LineNumber,
	|	EmploymentContractEmployees.Employee,
	|	EmploymentContractEmployees.Period,
	|	EmploymentContractIncomeTaxes.EarningAndDeductionType,
	|	EmploymentContractIncomeTaxes.Currency,
	|	0,
	|	UNDEFINED
	|FROM
	|	Document.EmploymentContract.Employees AS EmploymentContractEmployees
	|		INNER JOIN Document.EmploymentContract.IncomeTaxes AS EmploymentContractIncomeTaxes
	|		ON EmploymentContractEmployees.ConnectionKey = EmploymentContractIncomeTaxes.ConnectionKey
	|			AND EmploymentContractEmployees.Ref = EmploymentContractIncomeTaxes.Ref
	|WHERE
	|	EmploymentContractEmployees.Ref = &Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT 
	|	TableEmployees.Company,
	|	TableEmployees.LineNumber,
	|	TableEmployees.Employee,
	|	TableEmployees.StructuralUnit,
	|	TableEmployees.Position,
	|	TableEmployees.WorkSchedule,
	|	TableEmployees.OccupiedRates,
	|	TableEmployees.Period
	|FROM
	|	TableEmployees AS TableEmployees
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT 
	|	TableEarningsDeductions.Company,
	|	TableEarningsDeductions.LineNumber,
	|	TableEarningsDeductions.Employee,
	|	TableEarningsDeductions.Period,
	|	TableEarningsDeductions.EarningAndDeductionType,
	|	TableEarningsDeductions.Currency,
	|	TableEarningsDeductions.Amount,
	|	TableEarningsDeductions.GLExpenseAccount,
	|	TRUE AS Actuality
	|FROM
	|	TableEarningsDeductions AS TableEarningsDeductions");
	
	Query.SetParameter("Ref", DocumentRefCreateEmploymentContract);
	Query.SetParameter("Company", StructureAdditionalProperties.ForPosting.Company);
	
	TempTablesManager = New TempTablesManager;
	Query.TempTablesManager = TempTablesManager;
	
	ResultsArray = Query.ExecuteBatch();
	
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableEmployees",			ResultsArray[2].Unload());
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableCompensationPlan",	ResultsArray[3].Unload());
	
	StructureAdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager = Query.TempTablesManager;
	
EndProcedure

#Region PrintInterface

// Fills in the list of printing commands.
// 
// Parameters:
//   PrintCommands - ValueTable - see fields' content in the PrintManagement.CreatePrintCommandsCollection function.
//
Procedure AddPrintCommands(PrintCommands) Export
	
	
	
EndProcedure

#EndRegion

#EndIf
